src/cfe/Catalogs/ОбработчикиОчередиЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ОбработчикиОчередиЗаданий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьЗадания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Методы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/Catalogs/ОбработчикиОчередиЗаданий/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс
	
Функция РасписаниеПоУмолчанию() Экспорт
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ПериодПовтораДней = 1;
	Расписание.ПериодПовтораВТечениеДня = 60;
	
	Возврат Расписание;
	
КонецФункции

// Обработчик обновления
//
Процедура ПеренестиДанныеИзРегламентногоЗадания() Экспорт
	
	Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.УдалитьОбработкаОчередиЗаданийБТС);
	НайденныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	Для Каждого Задание Из НайденныеЗадания Цикл
		Ссылка = Справочники.ОбработчикиОчередиЗаданий.ПолучитьСсылку(Новый УникальныйИдентификатор(Задание.Ключ));
		ОбработчикОчередиЗаданий = Ссылка.ПолучитьОбъект();
		Если ОбработчикОчередиЗаданий <> Неопределено Тогда
			ОбработчикОчередиЗаданий.Использование = Задание.Использование;
			ОбработчикОчередиЗаданий.Расписание = Новый ХранилищеЗначения(Задание.Расписание);
			ОбработчикОчередиЗаданий.ОбменДанными.Загрузка = Истина;
			ОбработчикОчередиЗаданий.Записать();
		КонецЕсли;
		Задание.Удалить();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
